grouper-ws/grouper-ws/doc/xmlExamples/stemDeleteSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <ns1:stemDelete xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
      <ns1:wsStemLookups>
        <ns1:stemName>aStem:stemNotExist</ns1:stemName>
      </ns1:wsStemLookups>
      <ns1:actAsSubjectLookup>
        <ns1:subjectId>GrouperSystem</ns1:subjectId>
      </ns1:actAsSubjectLookup>
    </ns1:stemDelete>
  </soapenv:Body>
</soapenv:Envelope>